InformationRegisters/ВерсииОбъектов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<InformationRegister>
		<Properties>
			<Name>ВерсииОбъектов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ВерсияОбъекта</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>АвторВерсии</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВнешниеПользователи</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВерсии</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПеремещениеЗапасов</v8:Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
						<v8:Type>cfg:DocumentRef.РасходСоСчета</v8:Type>
						<v8:Type>cfg:DocumentRef.НачислениеПениПоЛС</v8:Type>
						<v8:Type>cfg:DocumentRef.ОприходованиеЗапасов</v8:Type>
						<v8:Type>cfg:DocumentRef.НачислениеПоЛС</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеВКассу</v8:Type>
						<v8:Type>cfg:DocumentRef.УправлениеУслугамиПодробно</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеЗапасовУслуг</v8:Type>
						<v8:Type>cfg:CatalogRef.ПриборыУчета</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:DocumentRef.УправлениеСубсидиями</v8:Type>
						<v8:Type>cfg:DocumentRef.УправлениеПриборамиУчета</v8:Type>
						<v8:Type>cfg:DocumentRef.УправлениеТарифами</v8:Type>
						<v8:Type>cfg:CatalogRef.ОбъектыЛицевыхСчетов</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеНаСчет</v8:Type>
						<v8:Type>cfg:DocumentRef.ПеремещениеДенежныхСредств</v8:Type>
						<v8:Type>cfg:DocumentRef.УправлениеЛьготами</v8:Type>
						<v8:Type>cfg:DocumentRef.СписаниеЗапасов</v8:Type>
						<v8:Type>cfg:DocumentRef.ВозвратПоставщику</v8:Type>
						<v8:Type>cfg:DocumentRef.РаспределениеОбщедомовыхПриборовУчета</v8:Type>
						<v8:Type>cfg:DocumentRef.УправлениеСоставомЖильцов</v8:Type>
						<v8:Type>cfg:DocumentRef.УправлениеУслугами</v8:Type>
						<v8:Type>cfg:CatalogRef.ЛицевыеСчета</v8:Type>
						<v8:Type>cfg:DocumentRef.ИзменениеЛицевогоСчета</v8:Type>
						<v8:Type>cfg:CatalogRef.Услуги</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НомерВерсии</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ВерсииОбъектов/Forms/ФормаСписка/Ext/Form/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ТАБЛИЦЫ ФОРМЫ Список

&НаКлиенте
Процедура СписокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	Отказ = Истина;
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ КОМАНД ФОРМЫ

&НаКлиенте
Процедура УдалитьЗаписи(Команда)
	
	ТекстВопроса = НСтр("ru='Несогласованное удаление записей по версиям объектов может привести"
"к нарушению последовательности записей и в дальнейшем к недостоверности отчета по изменениям. Продолжить?';uk=""Неузгоджене видалення записів по версіях об'єктів може привести  до порушення послідовності записів і надалі до невірогідності звіту по змінах. Продовжити?""");
	Ответ = Вопрос(ТекстВопроса, РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Нет, НСтр("ru='Предупреждение';uk='Попередження'"));
	Если Ответ = КодВозвратаДиалога.Да Тогда
		УдалитьВерсииИЗРегистра(Элементы.Список.ВыделенныеСтроки);
	КонецЕсли;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

&НаСервере
Процедура УдалитьВерсииИЗРегистра(знач МассивКлючейЗаписей)
	
	Для Каждого КлючЗаписи Из МассивКлючейЗаписей Цикл
		НаборЗаписей = РегистрыСведений.ВерсииОбъектов.СоздатьНаборЗаписей();
		
		НаборЗаписей.Отбор.Объект.Значение = КлючЗаписи.Объект;
		НаборЗаписей.Отбор.Объект.ВидСравнения = ВидСравнения.Равно;
		НаборЗаписей.Отбор.Объект.Использование = Истина;
		
		НаборЗаписей.Отбор.НомерВерсии.Значение = КлючЗаписи.НомерВерсии;
		НаборЗаписей.Отбор.НомерВерсии.ВидСравнения = ВидСравнения.Равно;
		НаборЗаписей.Отбор.НомерВерсии.Использование = Истина;
		
		НаборЗаписей.Записать(Истина);
	КонецЦикла;
	
	Элементы.Список.Обновить();
	
КонецПроцедуры
